Repository: dbeaubien/ExportImport-Component
Catalog: Components/Code Analysis.4dbase/Resources/*.lproj/Common.xlf
Languages: fr

# TabLabel_Complexity
source: Complexity
fr: Complexité

# TabLabel_Methods
source: Methods
fr: Méthodes

# TabLabel_Folders
source: Folders
fr: Dossiers

# TabLabel_About
source: About
fr: À propos

# TabLabel_Analysis
source: Analysis
fr: Analyse

# TabLabel_Differences
source: Differences
fr: Différences

# TabLabel_Exporting
source: Exporting
fr: Export

# TabLabel_Indexes
source: Indexes
fr: Index

# TabLabel_FormProperties
source: Form Properties
fr: Propriétés Formulaires

# Btn_Set
source: Set
fr: Fixer…

# Btn_Show
source: Show
fr: Montrer

# Btn_Cancel
source: Cancel
fr: Annuler

# Btn_Add
source: Add
fr: Ajouter

# Btn_Delete
source: Delete
fr: Supprimer

# Btn_ShowOnDisk
source: Show on Disk
fr: Montrer sur le Disque

# Btn_ShowLogs
source: Show Logs
fr: Montrer Logs

# Btn_ShowReleaseNotes
source: Show Release Notes
fr: Liste des Modifications

# Btn_ViewGraphs
source: View Graphs
fr: Voir Graphes

# Btn_AnalyseCode
source: Analyse Code
fr: Analyser le Code

# Btn_SaveResults
source: Save Results
fr: Sauvegarder

# Btn_AnalyseIndexes
source: Analyse Indexes
fr: Analyser les Index

# Btn_WhichCmdsAreAnalyzed
source: Which commands are analysed...
fr: Les commandes analysées…

# Btn_ReCheck
source: Re-CHeck
fr: Recontrôler

# Btn_CheckForDiffs
source: Check for Diffs...
fr: Contrôle des Différences…

# Btn_CompareFolders
source: Compare Folders
fr: Comparer les Dossiers

# Btn_SetCompareFolder
source: Folder to Compare...
fr: Dossier à Comparer...

# Btn_AllAsText
source: All as Text
fr: Tout en Texte

# Btn_AllAsHTML
source: All as HTML
fr: Tout en HTML

# Btn_SharedAsHTML
source: "Shared" as HTML
fr: Partagées en HTML

# Btn_AsDocSet
source: As DocSet
fr: Au format DocSet

# Btn_TableFieldInfo
source: Table/Field Info
fr: Info Table/Champ

# Btn_ExportProperties
source: Export Properties
fr: Propriétés Export

# Btn_RemoveCodeStub
source: Remove Code Stub
fr: Supprimer le code du stub

# Btn_Preferences
source: Preferences...
fr: Préférences…

# Btn_ReleaseNotes
source: Release Notes...
fr: Notes de MàJ…

# Btn_DetailedReports
source: Detailed Reports
fr: Rapports Détaillés
