Repository: dbeaubien/ExportImport-Component
Catalog: Components/Code Analysis.4dbase/Resources/*.lproj/Preferences.xlf
Languages: fr

# Label_RootFolder
source: Root Folder for all Generated Files:
fr: Dossier commun à tous les exports:

# Msg_SelectFolder
source: Select the destination folder
fr: Sélectionner le dossier de destination

# Btn_ShowUserDict
source: Show User Dictionary...
fr: Montrer le dictionnaire utilisateur…

# CB_COMP_IncCompMthds
source: Include Compiled Methods in Analysis
fr: Inclure les méthodes Compiler lors de l'analyse

# CB_COMP_IsFloating
source: Is Floating Palette
fr: Palette flottante

# Label_COMP_Thresholds
source: Cyclomatic Complexity Thresholds:
fr: Seuil de complexité cyclomatique:

# Label_COMP_Settings
source: Code Analysis Settings:
fr: Réglages de Code Analysis:

# Label_COMP_QLaunch
source: Quick Launcher:
fr: Accès rapide:

# Label_COMP_To
source: to
fr: à

# Label_COMP_LowRisk
source: Low Risk
fr: Risque faible

# Label_COMP_MedRisk
source: Med Risk
fr: Risque moyen

# Label_COMP_HighRisk
source: High Risk
fr: Risque élevé

# Msg_COMP_ResetConfirm
source: Please confirm that you want to reset the medium risk to start at 11 and high risk to start at 25.
fr: Confirmer que vous souhaitez réinitialiser le risque moyen à 11 et le risque élevé à 25

# Msg_COMP_UserDictAlert
source: A User Dictionary has not been created yet.
fr: Aucun dictionnaire utilisateur n'a encore été créé

# Msg_COMP_MedRisk_ToLow
source: The medium risk threshold must be 2 or higher.
fr: Le seuil du risque moyen doit être au moins à 2

# Msg_COMP_MedRisk_ToHigh
source: The medium risk threshold must be be lower than the high risk threshold.
fr: Le seuil du risque moyen doit être inférieur à celui du risque élevé

# Msg_COMP_HighRisk_ToLow
source: The high risk threshold must be be greater than the medium risk threshold.
fr: Le seuil du risque élevé doit être supérieur à celui du risque moyen

# CB_MTHD_IgnoreMultSpcs
source: Ignore Multiple Spaces
fr: Ignorer les espaces multiples

# CB_MTHD_IgnoreCase
source: Ignore Case
fr: Ignorer la casse

# RB_MTHD_ApndNothing
source: Append Nothing
fr: Ne rien ajouter

# RB_MTHD_ApndDate
source: Append Date
fr: Ajouter la date

# RB_MTHD_ApndDateTime
source: Append Date & Time
fr: Ajouter date & heure

# Label_MTHD_DfltRootFldNameSection
source: Default Root Folder Name
fr: Nom du dossier commun par défaut

# Label_MTHD_ForExptMthds
source: For Exported Methods:
fr: Pour les méthodes importées:

# Label_MTHD_ForExptHTML
source: For Exported HTML Docs:
fr: Pour les documents HTML exportés:

# Label_MTHD_EOLCharSection
source: End-of-Line Character
fr: Caractère de fin de ligne

# Label_MTHD_AllExptUseEOL
source: All exported text will use the following as the EOL:
fr: Les exports auront le caractère de fin de ligne:

# Msg_MTHD_DfltFldNeeded
source: A default folder name must be specified.
fr: Vous devez spécifier un dossier par défaut

# Msg_MTHD_DfltFldBadChar
source: The default name cannot contain the folder separator "%1".
fr: Le nom par défaut ne doit pas contenir le séparateur de dossier "%1"

# Msg_MTHD_MinIndent
source: The minimum indent must be 1 or higher.
fr: L'indentation minimum doit être à 1

# Msg_MTHD_MaxIndent
source: The maximum indent must be 10 or less.
fr: L'indentation maximum est 10

# CB_MTHD_ExportFlat
source: Do Not Nest Exported Methods
fr: Ne pas imbriquer les méthodes exportées

# Label_FLDR_SelectedFolder
source: Details on Selected Folder:
fr: Informations sur le dossier sélectionné:

# Label_FLDR_ExtraToCopy
source: Extra Folders to Copy:
fr: Autres dossiers à copier:

# Label_FLDR_AppendToName
source: Append the following to the copied folder names:
fr: Ajouter ce qui suit aux noms des dossiers copiés:

# RB_FLDR_AppNothing
source: Append Nothing
fr: Ne rien ajouter

# RB_FLDR_AppDate
source: Append Date
fr: Ajouter date

# RB_FLDR_AppDateTime
source: Append Date & Time
fr: Ajouter date & heure

# Msg_FLDR_SelectFolder
source: You must select a folder that is a subfolder of the folder that the structure is in.
fr: Vous devez sélectionner un sous dossier situé à coté de la structure

# Msg_FLDR_AlreadyAdded
source: "%1" has already been added.
fr: "%1" a déjà été ajouté

# Msg_FLDR_ConfirmDelete
source: Please confirm that you want to remove "%1" from the list of folders to copy.
fr: Confirmer le retrait de "%1" de la liste des dossiers à copier

# MSg_FLDR_DoesNotExist
source: "%1" does not exist on the disk.
fr: "%1" n'existe pas sur le disque

# Label_FLDR_ActualPath
source: Actual Path of Folder Relative to Structure:
fr: Chemin actuel du dossier relatif à la structure:

# Label_STRCT_DfltFolder
source: Default Folder Name to Contain Exported Form Properties:
fr: Nom du dossier par défaut pour l'export des propriétés formulaires:

# CB_STRCT_AppDateTime
source: Append Date/Time to Folder Name at Time of Export
fr: Horodater le dossier lors de l'export

# Msg_STRCT_DfltFldBadChar
source: The default name cannot contain the folder separator "%1".
fr: Le nom par défaut ne peut pas contenir le séparateur de dossier "%1"

# Label_ABT_DevBy
source: developed by Dani Beaubien of Open Road Development
fr: developpé par Dani Beaubien, Open Road Development

# Label_ABT_Desc
source: This component provides some basic tools that allows 4D Developers to manage their code in ways that have not been easy historically. The ability to get useful statistics, indicators of complexity, code changes and the ability to easily produce documentation is invaluable to a busy developer.
fr: Code Analysis fournit au développeur 4D les outils élémentaires pour gérer son code comme jamais il ne le pouvait jusqu'à présent. La possibilité de d'obtenir des statistiques pertinentes, des indicateurs de complexité, des modifications de code et une documentation sont d'une inestimable valeur pour le développeur.

# Label_ABT_Copyright
source: Copyright ©2012-2021 Open Road Development Inc. All rights reserved.
fr: Copyright ©2012-2021 Open Road Development Inc. Tous droits réservés

# CB_ABT_EnableLogging
source: Enable Debug Logging
fr: Activer débogage

# Label_ABT_SpecialThanks
source: Special Thanks
fr: Remerciements à :

# Txt_ABT_SpecialThanks
source: Bertrand Soubeyrand for localization to French. David Dancy for conversion of Matthias Hertel's DIFF C# code to 4D
fr: Bertrand Soubeyrand pour la localisation en français. David Dancy pour le portage vers 4D de DIFF écrit en C# par Matthias Hertel.

# Label_MTHD_DiffAnalSection
source: Method DIFF Analysis
fr: Analyse méthode DIFF

# Label_MTHD_NbrSpcsToIndent
source: Number of spaces to indent on code view
fr: Nombre d'espaces pour l'indentation du code
